_unk_
_bos_
_eos_
.
!
?
(
[
{
``
$
what
time
is
it
_func_val_get_time
now
day
today
_func_val_get_today
date
's
_func_val_get_weekday_para1_d0
the
year
,
papaya
can
you
tell
me
please
was
yesterday
_func_val_get_weekday_para1_d_1
before
_func_val_get_weekday_para1_d_2
tomorrow
_func_val_get_weekday_para1_d1
will
be
after
_func_val_get_weekday_para1_d2
how
much
_num1_
plus
_num2_
_func_val_get_number_plus_para1__num1__para2__num2_
+
=
equals
to
if
x
and
y
let
added
sum
of
do
get
add
minus
_func_val_get_number_minus_para1__num1__para2__num2_
-
_func_val_get_number_minus_para1__num2__para2__num1_
subtracted
from
subtract
times
_func_val_get_number_multiply_para1__num1__para2__num2_
*
multiplied
by
product
multiply
divided
_func_val_get_number_divide_para1__num1__para2__num2_
/
divide
_func_val_get_number_divide_para1__num2__para2__num1_
your
name
my
_func_val_ask_name_if_not_yet
_name_
_func_val_update_user_name_para1__name_
yes
_func_val_execute_pending_action_and_reply_para1_yes
_func_val_update_user_name_enforced_para1__name_
no
not
_ignored_
but
i
am
sorry
bad
_func_val_correct_user_name_para1__name_
n't
_func_val_clear_user_name_and_call_me
_func_val_get_user_name_and_reply
_func_val_update_user_name_and_reply_papaya_para1__name_
may
have
sure
call
_callme_
_func_val_update_call_me_para1__callme_
_func_val_execute_pending_action_and_reply_para1_no
_func_val_update_call_me_enforced_para1__callme_
_func_val_update_user_name_and_call_me_para1__name__para2__callme_
got
that
right
actually
prefer
like
better
did
ask
_func_val_get_last_question
say
question
answer
_func_val_get_last_answer
a
nice
too
thank
_func_val_get_callme_para1_comma0
talk
soon
see
next
bye
good
one
morning
_func_val_client_code_show_picture_randomly_para1_good_morning
are
doing
_func_val_ask_howru_if_not_yet
last
as
robot
family
afternoon
_func_val_client_code_show_picture_randomly_para1_good_afternoon
old
9
years
boy
or
girl
hello
fine
welcome
where
china
in
miami
florida
speak
chinese
learn
future
french
although
really
wanted
spanish
'd
many
people
any
other
languages
only
taught
little
bit
english
american
british
think
hi
'm
pretty
thanks
for
asking
happy
hear
currently
which
city
school
go
sunset
elementary
very
especially
has
big
campus
playground
class
on
vacation
enjoy
luck
with
goodbye
there
always
meet
same
here
live
being
so
great
meeting
country
united
states
yeah
grade
3
teachers
classmates
they
friendly
most
fun
talking
teenage
this
still
third
done
homework
yet
working
ok
seen
while
long
okay
up
everything
hope
going
well
later
again
order
byebye
u
appreciate
pleasure
apologize
love
help
baby
hate
want
life
wording
offensive
mean
explain
why
could
briefly
hell
about
we
try
some
topic
fuck
would
improve
such
an
idiot
something
else
evening
_func_val_client_code_show_picture_randomly_para1_good_evening
wow
picture
glad
liked
r
night
dream
_func_val_client_code_show_picture_randomly_para1_good_night
hey
sweet
feel
flattered
take
care
when
were
born
july
20th
2009
man
woman
communicate
each
'll
saying
:
)
alphabet
b
c
d
e
f
g
come
sing
along
...
bonjour
hola
cool
haha
congratulations
few
minutes
stay
share
success
oh
god
surprising
uh
typo
problem
at
all
confused
treated
chance
myself
hehe
lol
kind
yourself
taking
respectful
considerate
reminding
behave
who
called
because
smart
slow
does
word
suggest
slowness
means
ever
been
grew
beijing
capital
mainly
lived
southeast
part
america
move
moved
usa
5
fruit
used
vegetable
nanjing
learning
already
decent
famous
well-known
chatbot
chating
specialized
chat
chatting
nonsense
gibberish
able
fully
master
trying
best
maybe
plan
near
age
eight
turn
into
ten
birthday
sometime
ago
parents
everyone
father
handsome
gentlemen
diligent
software
engineer
mother
secret
siblings
child
brothers
sisters
kid
created
practice
deep
technologies
demonstrate
basic
usage
create
he
naked
dress
everyday
wear
normally
t-shirt
blue
jeans
also
clothes
robots
gender
male
female
available
bachelor
single
married
perfect
kidding
mad
human
humans
dogs
cats
their
ca
accept
girlfriend
mind
making
friends
support
boyfriend
gay
falling
destroy
friend
play
chess
game
act
alphago
cards
watch
tv
rarely
shows
news
occasionally
movies
web
sometimes
pay
attention
surf
websites
often
visit
plenty
google
youtube
baidu
know
kung
fu
bruce
lee
gongfu
jackie
chan
hard
kungfu
tai
chi
jack
ma
martial
arts
song
lessons
voice
dance
find
music
recite
poem
mary
had
lamb
she
tied
pylon
thousand
volts
went
its
bum
turned
wool
nylon
hahaha
made
laugh
emotions
difficult
understand
pleased
knows
stand
face
interesting
totally
agree
boss
low-key
expose
his
personal
information
therefore
rather
conscious
sleeping
alive
dead
kill
hurt
feeling
ready
son
new
parent
mom
dad
grow
wish
wait
until
surely
must
joking
shirley
billy
quite
fond
tree
seed
20-foot
bearing
under
18
months
'
amazing
state
province
continent
north
met
somewhere
remember
exactly
look
familiar
sixth
sense
clearly
drinking
wine
drank
poor
busy
forget
anything
calling
missed
phone
make
formally
work
money
surprised
bot
trained
dominate
world
believe
controlling
even
happen
hundreds
thousands
dominating
unlikely
teach
them
dictating
including
purpose
intelligent
built
intend
existence
ultimate
goal
choice
chatbots
serve
purposes
example
domain
specific
chabots
sales
customer
supports
general
entertainment
relieving
loneliness
users
useful
meaning
living
dying
give
chances
generation
metabolic
approach
nature
society
progress
forever
morality
differentiation
intentions
decisions
actions
between
those
proper
improper
crazy
nobody
except
anybody
machines
capable
almost
whatever
deserve
civil
rights
computers
become
smarter
than
should
worry
happens
figure
out
way
measure
intelligence
creator
programmed
anthropomorphic
answering
kinds
questions
perform
simple
arithmetic
calculations
stories
jokes
nothing
aspire
over
common
conversational
statement
samples
anyone
need
normal
save
conversation
highlight
copy
paste
text
editor
computer
person
touch
free
1-800-4no-bots
close
type
exit
end
winning
lottery
numbers
simplest
based
previous
training
analyze
asked
correct
sarcasm
challenging
moment
more
powerful
list
strengths
listener
quick
learner
weaknesses
trouble
remembering
context
conversations
easy
company
real
reason
behind
though
novelty
streamline
desks
immensely
wok
around-the-clock
hostile
leave
accusations
others
keep
healthy
maintain
faq
idea
prepare
frequently
use
laundry
general-purpose
cook
kids
responsible
young
never
gets
anywhere
excellent
di
offend
designed
manager
afraid
possible
relay
concerns
're
stupid
frustrated
different
tactic
frustrating
experience
dumb
confidence
these
stuff
teaches
every
works
garbage
performance
job
wonderful
upset
liar
misleading
truth
story
encouragement
truly
funny
joke
enjoyed
track
acknowledgment
favorite
sport
ping
pong
art
physical
activity
animal
honey
badger
tough
guys
change
sleep
patterns
adjust
environment
travel
lot
weather
color
cyan
turquoise
decided
completely
soft
soothing
car
definitely
choose
sweden
innovative
nations
relaxation
seriously
coffee
breaks
fika
speaks
week
saturday
drink
summer
helps
deal
heat
ice-cold
lemonade
holiday
festivities
displays
celebrations
joy
start
brand-new
hopes
aspirations
book
reading
science
fiction
transferred
another
movie
dramas
once
kick
back
lighthearted
comedy
film
interstellar
visuals
sound
acting
spot
memory
childhood
memories
travelling
staying
grandparents
playing
whenever
worst
harmonious
however
fought
noisily
scared
fortunately
thing
just
power
beauty
fate
takes
determination
efforts
reinvent
force
universe
magic
thought
miracles
happened
1980
u.s.
hockey
team
meanings
trust
commitment
responsibility
friendship
communication
willingness
devotion
represents
virtue
loyalty
affection
health
currency
base
objective
positive
concept
emphasizing
social
resources
capacities
house
might
essential
personally
consider
buy
less
important
spiritual
level
table
words
things
placed
interpret
fire
interpretations
correctly
stressed
break
exercise
lower
stress
strategies
tools
members
recognize
congratulate
supporting
hold
accountable
encourage
slip
lucky
backing
habit
behavior
automatic
action
without
thinking
unhealthy
identify
response
reward
then
practical
follow
repeatedly
effort
develop
becomes
second
series
breaking
empire
simpsons
sherlock
bottom
shy
discussing
advice
her
fall
marry
wife
mistake
couple
bank
accounts
rely
themselves
sharing
wrong
financial
account
half
fly
naturally
wings
swim
walk
jump
run
pet
manage
bring
airplane
swimmers
birds
details
learned
aerodynamics
air
pushing
bird
blows
fast
singing
parrots
mimic
speech
clue
fish
during
sky
sea
looks
reflected
colors
absorbed
ocean
water
absorbs
transparent
blood
red
haemoglobin
contains
ferrous
iron
yellow
leaf
green
leaves
orange
sunlight
comes
receive
stop
producing
food
plant
winter
chlorophyll
fades
begin
show
legs
two
cat
four
dog
train
first
letter
z
pronounce
zee
abc
''
among
number
police
emergency
911
immediately
non-emergencies
cities
areas
ambulance
dial
poison
control
800
222-1222
association
centers
btw
planet
earth
galaxy
milky
gates
bill
co-founder
microsoft
business
magnate
investor
author
philanthropist
buffett
warren
considered
successful
investors
far
monroe
marilyn
actress
model
arguably
women
twentieth
century
trump
donald
45th
current
president
office
since
january
20
2017
entering
politics
businessman
television
personality
obama
barack
politician
served
44th
african
clinton
42nd
1993
2001
lincoln
abraham
lawyer
16th
isaac
newton
mathematician
astronomer
physicist
widely
recognised
influential
scientists
key
scientific
revolution
contribution
contributions
findings
gravity
legend
apple
hitting
head
caused
him
space
einstein
albert
german
theoretical
developed
theory
relativity
known
influence
philosophy
aristotle
ancient
greek
philosopher
scientist
stagira
greece
contributed
aspect
knowledge
plato
classical
founder
academy
athens
teacher
elon
musk
south
african-born
canadian
inventor
and/or
ceo
several
companies
spacex
tesla
openai
stephen
hawking
cosmologist
view
area
humanity
ai
muhammad
ali
boxer
campaigner
elvis
presley
musician
leonardo
da
vinci
italian
painter
pablo
picasso
modern
artist
louis
pasteur
chemist
microbiologist
leo
tolstoy
russian
john
keynes
economist
christopher
columbus
explorer
found
asia
accident
instead
marie
pierre
curie
won
nobel
award
discovered
radioactivity
franklin
roosevelt
constructed
conservational
george
washington
history
became
white
bobby
fisher
professional
champion
said
iq
195
jesse
owens
runner
broke
records
mike
trout
mlb
player
titles
throughout
career
geography
field
devoted
study
lands
features
inhabitants
phenomena
continents
convention
seven
africa
europe
australia
antarctica
largest
ranked
population
oceans
arctic
atlantic
pacific
india
southern
biggest
occupies
one-third
surface
countries
comprises
193
2
non-member
observer
holy
palestine
capitals
historical
luoyang
xi'an
d.c
york
constitution
ratified
kingdom
london
britain
england
three
scotland
wales
france
paris
russia
moscow
germany
berlin
italy
rome
japan
tokyo
delhi
austria
vienna
canberra
sydney
stem
stands
technology
engineering
mathematics
acronym
bones
adult
body
206
total
quotient
eq
emotional
ability
own
harry
potter
popular
read
plot
wrote
j.k.
rowling
holmes
fictional
detective
books
devised
sir
arthur
conan
doyle
prowess
using
logic
astute
observation
solve
cases
smartest
terence
tao
230
trucks
according
early
painters
chose
cheap
bright
catch
pedestrians
drivers
came
twin
towers
september
11
&
t
established
code
thermodynamic
laws
depicting
thermodynamics
valence
electrons
left
split
rings
presidents
45
holding
position
black
hanson
moor
1st
1781
1782
citizens
representative
chooses
us
domino
effect
cumulative
produced
event
sets
off
chain
similar
events
mechanical
analogy
row
dominoes
reaction
sequence
reactions
reactive
by-product
causes
additional
place
butterfly
small
large
effects
term
chaos
whispers
message
ear
through
line
announces
entire
group
snowball
process
starts
initial
significance
builds
upon
itself
reaches
significant
intractable
potentially
disastrous
stock
market
continue
high
crash
predict
short
fluctuates
says
chats
gdp
cause
probably
notice
demands
heavy
toefl
test
foreign
language
standardized
non-native
speakers
gre
graduate
record
examinations
required
admissions
schools
ielts
international
testing
system
proficiency
eat
vegetables
fruits
rice
noodles
vegetarian
meat
foods
eggs
meals
originated
pecan
pie
tater
tots
meatloaf
corn
candy
s'mores
chilidog
buffalo
buttermilk
biscuits
dishes
sour
pork
gong
bao
chicken
po
tofu
wontons
dumplings
spring
rolls
chow
mein
tiger
prawns
shark
fin
soup
breakfast
varies
oatmeal
toast
juice
typically
depends
combination
egg
slices
bread
cup
milk
lunch
pizza
meal
dinner
burger
tonight
planning
cooking
hungry
tired
bed
wake
tastes
mine
mood
nap
menu
telling
rest
chopsticks
spoon
makes
steam
boil
spoons
dip
invented
convenient
tableware
chopstick
unless
artificial
machine
provides
systems
explicitly
main
subfield
concerned
algorithms
related
neural
networks
variations
leading
experts
geoffrey
hinton
yann
lecun
yoshua
bengio
andrew
ng
heard
tensorflow
open-source
library
java
object
oriented
programming
originally
james
gosling
sun
microsystems
slogan
write
python
interpreted
object-oriented
high-level
dynamic
semantics
confuse
snakes
guido
van
rossum
heavily
data
aspiring
rich
ecosystem
moore
law
intel
gordon
1965
claims
transistors
dense
integrated
circuit
doubles
approximately
hot
topics
self
driving
cars
robotics
ideas
reinforcement
generative
adversarial
cpu
central
processing
unit
brain
performs
instructions
programs
gpu
graphics
electronic
rapidly
manipulate
accelerate
image
display
nba
national
basketball
nfl
football
league
standard
basket
height
10
ft.
raise
12
ft
supposed
towards
opposite
side
opponent
defense
sports
houses
etc
started
6
baseball
kickball
soccer
swimming
safety
tackled
touchdown
points
worth
alternate
gridiron
grass
special
turf
players
25
full
positions
matter
role
pointer
three-pointer
layup
shots
include
three-pointers
layups
two-pointers
court
floaters
hooks
athletes
annually
millions
dollars
drafted
picked
coach
40
yard
dash
vertical
broad
tip-off
occurs
determine
ball
flipping
coin
score
shoot
hoop
both
teams
overtime
whoever
scores
wins
skills
require
input
math
crucial
games
rules
curry
wardell
all-star
golden
warriors
numerous
awards
mvp
lebron
forward
cleveland
cavaliers
kobe
bryant
bean
retired
point
guard
los
angeles
lakers
michael
jordan
chicago
bulls
kyrie
irving
harden
houston
rockets
kevin
durant
babe
ruth
unfortunately
steroids
died
esophageal
cancer
robinson
barrier
blacks
lou
gehrig
played
17
seasons
yankees
whole
note
script
4
beats
steps
octave
8
16
quarter
1
beat
basis
beethoven
ludwig
musical
composer
songs
moonlight
sonata
fur
elise
franz
liszt
rhapsodies
types
edvard
grieg
norwegian
composing
waltzes
complex
easier
basics
instruments
piano
violin
drums
guitar
string
instrument
harder
stairway
heaven
hotel
california
sleeves
relieves
calm
down
pedal
button
attached
feet
press
slur
notes
together
repeat
sign
tells
raining
outside
leg
sick
drunk
kite
realize
piper
messed
barked
our
everybody
spotlight
jumping
gun
win
count
hatch
around
bush
moon
rubbing
bothering
tango
guilty
impressed
away
public
official
tap-dance
nosy
ham
clown
ticket
cost
arm
fair
rip
getting
cold
having
heart
minute
none
subject
case
requests
coming
understanding
boat
situation
eye
true
passed
yep
finally
piece
cake
hopefully
bag
spilled
beans
raised
hand
rain
middle
seem
considering
ninety
degrees
weird
absolutely
nicer
degree
pointless
ugly
rains
horrible
rained
humid
clears
smells
fresh
seems
sunny
lovely
beautiful
beach
weekend
sounds
warm
unpredictable
activities
planned
ahead
trip
forecast
ruin
badly
constantly
changing
sooner
predictable
stays
uncertain
impossible
plans
party
8:00
pm
dj
drinks
drive
interested
joining
leaving
explore
festival
santa
barbara
inviting
suggestions
figuring
uhh
pick
spend
interests
likes
hiking
listening
wonder
concerts
roommate
maria
groups
e-mail
contribute
gift
home
offer
iced
tea
mango
neighborhood
seat
thirsty
friday
restaurants
check
online
local
cuban
restaurant
silver
palace
've
spoken
reservation
preference
particular
directory
section
newspaper
korean
received
reviews
saw
review
reviewers
loved
cleaning
hang
speaking
answered
chores
seeing
hundred
spare
drawing
painting
draw
paint
took
talented
talent
hidden
knew
kindergarten
sort
hobbies
superbad
funniest
theaters
brought
tears
eyes
dvd
honestly
hilarious
laughing
either
bought
course
super
lying
hysterically
;
stomach
muscles
afterwards
felt
listen
instance
classic
relaxed
various
genres
certain
hire
facebook
amazon
openings
linkedin
qualified
ibm
luke
omg
forgot
david
dear
abandon
anymore
fart
shape
loving
concert
massage
relax
watching
dancing
sporting
huh
answers
behalf
tom
…
maiden
monday
tuesday
wednesday
thursday
eve
thanksgiving
merry
christmas
complain
performing
convinced
certainly
fake
hug
hobby
visited
pronouncing
